Revit 2024 API
ViewSchedule.CanUngroupHeaders Method
 Indicates if selected headers can be ungrouped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool CanUngroupHeaders(
	int top,
	int left,
	int bottom,
	int right
)
Visual Basic
Public Function CanUngroupHeaders ( _
	top As Integer, _
	left As Integer, _
	bottom As Integer, _
	right As Integer _
) As Boolean
Visual C++
public:
bool CanUngroupHeaders(
	int top,
	int left,
	int bottom,
	int right
)
Parameters
top
Type: System.Int32
 The index of the top row of the selected headers.
left
Type: System.Int32
 The index of the left column of the selected headers.
bottom
Type: System.Int32
 The index of the bottom row of the selected headers.
right
Type: System.Int32
 The index of the right column of the selected headers.
Return Value
 True if the selected headers can be grouped, false otherwise.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace